In [25]:
import pandas as pd
import altair as alt
import numpy as np

In [34]:
df = pd.read_csv('data/billionaires.csv', parse_dates=['birthDate'])
df['education'] = df['education'].astype('Int64')

In [35]:
df.head()

,finalWorth,category,personName,age,country,source,industries,status,gender,birthDate,gdp_country,life_expectancy_country,total_tax_rate_country,economic_class,education
0,211000,Fashion & Retail,Bernard Arnault & family,74.0,France,LVMH,Fashion & Retail,U,M,1949-03-05,"$2,715,518,274,227.00",82.5,60.7,1,3
1,80500,Fashion & Retail,Francoise Bettencourt Meyers & family,69.0,France,L'Oréal,Fashion & Retail,U,F,1953-07-10,"$2,715,518,274,227.00",82.5,60.7,1,<NA>
2,40100,Fashion & Retail,François Pinault & family,86.0,France,Luxury goods,Fashion & Retail,D,M,1936-08-21,"$2,715,518,274,227.00",82.5,60.7,1,0
3,22000,Food & Beverage,Emmanuel Besnier,52.0,France,Cheese,Food & Beverage,D,M,1970-09-18,"$2,715,518,274,227.00",82.5,60.7,1,<NA>
4,9800,Logistics,"Jacques Saadé, Jr.",51.0,France,Shipping,Logistics,Split Family Fortune,M,1971-08-10,"$2,715,518,274,227.00",82.5,60.7,1,<NA>

In [36]:
df.shape

(2657, 15)

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2657 entries, 0 to 2656
Data columns (total 15 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   finalWorth               2657 non-null   int64
 1   category                 2657 non-null   object
 2   personName               2657 non-null   object
 3   age                      2604 non-null   float64
 4   country                  2657 non-null   object
 5   source                   2657 non-null   object
 6   industries               2657 non-null   object
 7   status                   2657 non-null   object
 8   gender                   2657 non-null   object
 9   birthDate                2593 non-null   datetime64[ns]
 10  gdp_country              2545 non-null   object
 11  life_expectancy_country  2545 non-null   float64
 12  total_tax_rate_country   2545 non-null   float64
 13  economic_class           2657 non-null   int64
 14  education                1176 non-null   Int64
dtypes: Int64(1), datetime64[ns](1), float64(3), int64(2), object(8)
memory usage: 314.1+ KB

In [26]:
df = df.replace('', np.nan, regex=True)

In [17]:
# for column in df.columns:
#     freq = df[column].value_counts() 
#     print(freq)

In [41]:
df['category'].value_counts(dropna=False)

category
Finance & Investments         367
Technology                    331
Manufacturing                 323
Fashion & Retail              267
Food & Beverage               207
Healthcare                    203
Diversified                   198
Real Estate                   191
Energy                         99
Media & Entertainment          92
Automotive                     77
Metals & Mining                76
Service                        49
Construction & Engineering     44
Logistics                      39
Sports                         38
Telecom                        31
Gambling & Casinos             25
Name: count, dtype: int64

In [12]:
df.columns

Index(['finalWorth', 'category', 'personName', 'age', 'country', 'source',
       'industries', 'status', 'gender', 'birthDate', 'gdp_country',
       'life_expectancy_country', 'total_tax_rate_country', 'economic_class',
       'education'],
      dtype='object')

In [43]:
numeric_columns = ['finalWorth', 'age', 'birthDate', 'gdp_country',
       'life_expectancy_country', 'total_tax_rate_country']

In [44]:
# central tendencies
df[numeric_columns].describe()

,finalWorth,age,birthDate,life_expectancy_country,total_tax_rate_country
count,2657.000000,2604.000000,2593,2545.000000,2545.000000
mean,4605.193828,65.049539,1957-09-12 13:23:12.518318528,78.171984,43.592692
min,1000.000000,18.000000,1921-09-11 00:00:00,54.300000,11.300000
25%,1500.000000,56.000000,1948-04-04 00:00:00,77.000000,36.600000
50%,2300.000000,65.000000,1957-12-14 00:00:00,78.500000,37.900000
75%,4200.000000,74.000000,1966-10-23 00:00:00,80.900000,59.100000
max,211000.000000,101.000000,2004-05-06 00:00:00,84.200000,106.300000
std,9800.137699,13.145578,NaN,3.831262,12.194792